In [1]:
import numpy as np
import pandas as pd

In [6]:
ser = pd.Series([1, 2, 3], index=['a', 'b', 'c']) #create a serie with a specified index

In [3]:
data = [ {'a': i, 'b' : 2*i} for i in range(3) ]

In [4]:
df = pd.DataFrame(data)

In [5]:
df

   a  b
0  0  0
1  1  2
2  2  4

In [8]:
ser.loc['b']

2

In [9]:
ser.iloc[1]

2

In [14]:
area = pd.Series({'California' : 423967, 'Texas' : 695662,
                 'New York' : 141297, 'Florida' : 170312,
                 'Illinois' : 14995})
pop = pd.Series({'California' : 38332521, 'Texas' : 26448193,
                'New York' : 19651127, 'Florida' : 19552860,
                'Illinois' : 12882135})
data = pd.DataFrame({'area' : area, 'pop' : pop})
print(data)

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois     14995  12882135

In [16]:
data.loc['California', :'pop'] #print sp√©cific cell via its coordinates or a slice

area      423967
pop     38332521
Name: California, dtype: int64

In [17]:
data.loc['California']

area      423967
pop     38332521
Name: California, dtype: int64

In [20]:
def make_df(cols, ind):
    """Dataframe quick creation"""
    data = {c: [str(c) + str(i) for i in ind]
               for c in cols}
    return pd.DataFrame(data, ind)

In [21]:
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [22]:
df1 = make_df('AB', [1, 2])

In [23]:
df2 = make_df('AB', [3, 4])

In [24]:
pd.concat([df1, df2]) #concat two dataframes

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [25]:
df1 = pd.DataFrame({'employee' : ['Bob', 'Jake', 'Lisa', 'Sue'],
        'department' : ['Accounting', 'Engineering', 'Engineering', 'HR' ]})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                   'date': [2004, 2008, 2012, 2014]})

In [28]:
df3 = pd.merge(df1, df2) #merging two dataframes

In [38]:
df3

  employee   department  date
0      Bob   Accounting  2008
1     Jake  Engineering  2012
2     Lisa  Engineering  2004
3      Sue           HR  2014

In [40]:
df4 = pd.DataFrame({'department': ['Accounting', 'Engineering', 'HR'],
                  'supervisor' : ['Carly', 'Guido', 'Steve']})

In [36]:
df4

   departement supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [41]:
pd.merge(df3, df4)

  employee   department  date supervisor
0      Bob   Accounting  2008      Carly
1     Jake  Engineering  2012      Guido
2     Lisa  Engineering  2004      Guido
3      Sue           HR  2014      Steve

In [42]:
df5 = pd.DataFrame({'department' : ['Accounting', 'Accounting', 
                                    'Engineering', 'Engineering', 'HR', 'HR'],
                   'competence' : ['math', 'spreadsheets', 'coding', 'linux', 
                                  'spreadsheets', 'organization']})

In [43]:
pd.merge(df1, df5)

  employee   department    competence
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [44]:
df = pd.DataFrame({'key': ['A', 'B', 'C','A', 'B', 'C'],
                  'data' :  range(6)}, columns = ['key', 'data'])

In [45]:
print(df)

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [47]:
df.groupby('key').sum() #make a sum in a groupby querry

     data
key
A       3
B       5
C       7